.sbom/pipdeptree.3.11.mermaid
flowchart TD
    classDef missing stroke-dasharray: 5
    alembic["alembic<br/>1.19.2"]
    annotated-types["annotated-types<br/>0.8.0"]
    antlr4-python3-runtime["antlr4-python3-runtime<br/>4.13.2"]
    arrow["arrow<br/>1.4.0"]
    attrs["attrs<br/>26.1.0"]
    bidict["bidict<br/>0.24.1"]
    boolean-py["boolean.py<br/>5.0"]
    build["build<br/>1.6.0"]
    certifi["certifi<br/>2026.7.22"]
    chardet["chardet<br/>5.2.0"]
    charset-normalizer["charset-normalizer<br/>3.5.1"]
    click_0["click<br/>8.5.0"]
    coloredlogs["coloredlogs<br/>14.0"]
    cyclonedx-bom["cyclonedx-bom<br/>7.3.1"]
    cyclonedx-python-lib["cyclonedx-python-lib<br/>11.12.0"]
    dagster-pipes["dagster-pipes<br/>1.9.11"]
    dagster["dagster<br/>1.9.11"]
    defusedxml["defusedxml<br/>0.7.1"]
    dnspython["dnspython<br/>2.8.0"]
    docker-compose-graph["docker-compose-graph<br/>1.0.0.post1.dev7+g78fcf8e95"]
    docstring-parser["docstring_parser<br/>0.18.0"]
    email-validator["email-validator<br/>2.3.0"]
    filelock["filelock<br/>3.32.5"]
    fqdn["fqdn<br/>1.5.1"]
    fsspec["fsspec<br/>2026.7.0"]
    gazu["gazu<br/>1.2.2"]
    gitdb["gitdb<br/>4.0.12"]
    gitpython["GitPython<br/>3.1.62"]
    graphviz["graphviz<br/>0.21"]
    greenlet["greenlet<br/>3.5.5"]
    grpcio-health-checking["grpcio-health-checking<br/>1.71.2"]
    grpcio["grpcio<br/>1.83.1"]
    h11["h11<br/>0.16.0"]
    humanfriendly["humanfriendly<br/>10.0"]
    idna["idna<br/>3.19"]
    installer["installer<br/>1.0.1"]
    isoduration["isoduration<br/>20.11.0"]
    jinja2["Jinja2<br/>3.1.6"]
    jsonpointer["jsonpointer<br/>3.1.1"]
    jsonschema-specifications["jsonschema-specifications<br/>2025.9.1"]
    jsonschema["jsonschema<br/>4.26.0"]
    lark["lark<br/>1.3.1"]
    license-expression["license-expression<br/>30.4.4"]
    lxml["lxml<br/>6.1.3"]
    mako["Mako<br/>1.4.1"]
    markdown-it-py["markdown-it-py<br/>4.2.0"]
    markupsafe["MarkupSafe<br/>3.0.3"]
    mdurl["mdurl<br/>0.1.2"]
    nab-index["nab-index<br/>0.0.17"]
    nab-markersets["nab-markersets<br/>0.0.17"]
    nab-project["nab-project<br/>0.0.17"]
    nab-provider["nab-provider<br/>0.0.17"]
    nab-resolver["nab-resolver<br/>0.0.17"]
    openstudiolandscapes-dagstercodelocation-jobprocessor["OpenStudioLandscapes-DagsterCodeLocation-JobProcessor<br/>0.0.0"]
    openstudiolandscapes-dagstercodelocation-streamingprocess["OpenStudioLandscapes-DagsterCodeLocation-StreamingProcess<br/>0.0.0"]
    openstudiolandscapes-deadline-10-2["OpenStudioLandscapes-Deadline-10-2<br/>0.0.0"]
    packageurl-python["packageurl-python<br/>0.17.6"]
    packaging["packaging<br/>26.3"]
    pathlib-abc["pathlib_abc<br/>0.5.2"]
    pip-requirements-parser["pip-requirements-parser<br/>32.0.1"]
    pip["pip<br/>26.2.1"]
    pipdeptree["pipdeptree<br/>4.2.3"]
    protobuf["protobuf<br/>5.29.6"]
    py-serializable["py-serializable<br/>2.1.0"]
    pydantic-core["pydantic_core<br/>2.46.5"]
    pydantic["pydantic<br/>2.13.5"]
    pydot["pydot<br/>4.0.1"]
    pygments["Pygments<br/>2.21.0"]
    pyparsing["pyparsing<br/>3.3.2"]
    pyproject-hooks["pyproject_hooks<br/>1.2.0"]
    python-dateutil["python-dateutil<br/>2.9.0.post0"]
    python-dotenv["python-dotenv<br/>1.2.3"]
    python-engineio["python-engineio<br/>4.14.0"]
    python-socketio["python-socketio<br/>5.16.4"]
    pytz["pytz<br/>2026.3.post1"]
    pyyaml["PyYAML<br/>6.0.3"]
    referencing["referencing<br/>0.37.0"]
    requests["requests<br/>2.34.2"]
    rfc3339-validator["rfc3339-validator<br/>0.1.4"]
    rfc3986-validator["rfc3986-validator<br/>0.1.1"]
    rfc3987-syntax["rfc3987-syntax<br/>1.1.0"]
    rich["rich<br/>15.0.0"]
    rpds-py["rpds-py<br/>2026.6.3"]
    ruamel-yaml["ruamel.yaml<br/>0.19.1"]
    setuptools["setuptools<br/>84.0.0"]
    simple-websocket["simple-websocket<br/>1.1.0"]
    six["six<br/>1.17.0"]
    smmap["smmap<br/>5.0.3"]
    snakemd["SnakeMD<br/>2.4.1"]
    sortedcontainers["sortedcontainers<br/>2.4.0"]
    sqlalchemy["SQLAlchemy<br/>2.0.52"]
    structlog["structlog<br/>26.1.0"]
    tabulate["tabulate<br/>0.10.0"]
    tomli-w["tomli_w<br/>1.2.0"]
    tomli["tomli<br/>2.4.1"]
    toposort["toposort<br/>1.10"]
    tqdm["tqdm<br/>4.70.0"]
    truststore["truststore<br/>0.10.4"]
    typing-extensions["typing_extensions<br/>4.16.0"]
    typing-inspection["typing-inspection<br/>0.4.4"]
    tzdata["tzdata<br/>2026.3"]
    universal-pathlib["universal_pathlib<br/>0.3.10"]
    uri-template["uri-template<br/>1.3.0"]
    urllib3["urllib3<br/>2.7.0"]
    watchdog["watchdog<br/>5.0.3"]
    webcolors["webcolors<br/>25.10.0"]
    websocket-client["websocket-client<br/>1.9.2"]
    wheel["wheel<br/>0.48.0"]
    wsproto["wsproto<br/>1.3.2"]
    alembic -- ">=1.4.23" --> sqlalchemy
    alembic -- ">=4.12" --> typing-extensions
    alembic -- "any" --> mako
    arrow -- ">=2.7.0" --> python-dateutil
    arrow -- "any" --> tzdata
    bidict -- ">=4.0" --> typing-extensions
    build -- ">=24.0" --> packaging
    build -- "any" --> pyproject-hooks
    coloredlogs -- ">=7.1" --> humanfriendly
    cyclonedx-bom -- ">=0.11,<2" --> packageurl-python
    cyclonedx-bom -- ">=22,<27" --> packaging
    cyclonedx-bom -- ">=32.0,<33.0" --> pip-requirements-parser
    cyclonedx-bom -- ">=5.1,<6.0" --> chardet
    cyclonedx-bom -- ">=8.0,<12" --> cyclonedx-python-lib
    cyclonedx-python-lib -- ">=0.11,<2" --> packageurl-python
    cyclonedx-python-lib -- ">=2.1.0,<3.0.0" --> py-serializable
    cyclonedx-python-lib -- ">=2.4.0,<3.0.0" --> sortedcontainers
    cyclonedx-python-lib -- ">=30,<31" --> license-expression
    cyclonedx-python-lib -- ">=4.6,<5.0" --> typing-extensions
    cyclonedx-python-lib -- "[validation] >=0.28.4" --> referencing
    cyclonedx-python-lib -- "[validation] >=4,<7" --> lxml
    cyclonedx-python-lib -- "[validation] >=4.25,<5.0" --> jsonschema
    dagster -- "<3" --> tomli
    dagster -- "<5" --> tqdm
    dagster -- "==1.9.11" --> dagster-pipes
    dagster -- ">=0.8.3,<6" --> watchdog
    dagster -- ">=1.0" --> toposort
    dagster -- ">=1.0,<3" --> sqlalchemy
    dagster -- ">=1.2.1,!=1.6.3,!=1.7.0,!=1.11.0" --> alembic
    dagster -- ">=1.44.0" --> grpcio
    dagster -- ">=1.44.0" --> grpcio-health-checking
    dagster -- ">=2,<3.0.0" --> pydantic
    dagster -- ">=20.9" --> packaging
    dagster -- ">=4,<6" --> protobuf
    dagster -- ">=4.10.0,<5" --> typing-extensions
    dagster -- ">=5.0" --> click_0
    dagster -- ">=5.1" --> pyyaml
    dagster -- ">=6.1,<=14.0" --> coloredlogs
    dagster -- "any" --> antlr4-python3-runtime
    dagster -- "any" --> docstring-parser
    dagster -- "any" --> filelock
    dagster -- "any" --> jinja2
    dagster -- "any" --> python-dotenv
    dagster -- "any" --> pytz
    dagster -- "any" --> requests
    dagster -- "any" --> rich
    dagster -- "any" --> setuptools
    dagster -- "any" --> six
    dagster -- "any" --> structlog
    dagster -- "any" --> tabulate
    dagster -- "any" --> universal-pathlib
    docker-compose-graph -- "any" --> graphviz
    docker-compose-graph -- "any" --> jinja2
    docker-compose-graph -- "any" --> pydot
    docker-compose-graph -- "any" --> python-dotenv
    docker-compose-graph -- "any" --> pyyaml
    email-validator -- ">=2.0.0" --> dnspython
    email-validator -- ">=2.0.0" --> idna
    gazu -- ">=2.25.1" --> requests
    gazu -- ">=4" --> typing-extensions
    gazu -- ">=5.11.0,<6" --> python-socketio
    gazu -- "[cli] >=8.0" --> click_0
    gitdb -- ">=3.0.1,<6" --> smmap
    gitpython -- ">=4.0.1,<5" --> gitdb
    grpcio -- "~=4.12" --> typing-extensions
    grpcio-health-checking -- ">=1.71.2" --> grpcio
    grpcio-health-checking -- ">=5.26.1,<6.0.dev0" --> protobuf
    isoduration -- ">=0.15.0" --> arrow
    jinja2 -- ">=2.0" --> markupsafe
    jsonschema -- ">=0.25.0" --> rpds-py
    jsonschema -- ">=0.28.4" --> referencing
    jsonschema -- ">=2023.3.6" --> jsonschema-specifications
    jsonschema -- ">=22.2.0" --> attrs
    jsonschema -- "[format-nongpl] >0.1.0" --> rfc3986-validator
    jsonschema -- "[format-nongpl] >1.13" --> jsonpointer
    jsonschema -- "[format-nongpl] >=1.1.0" --> rfc3987-syntax
    jsonschema -- "[format-nongpl] >=24.6.0" --> webcolors
    jsonschema -- "[format-nongpl] any" --> fqdn
    jsonschema -- "[format-nongpl] any" --> idna
    jsonschema -- "[format-nongpl] any" --> isoduration
    jsonschema -- "[format-nongpl] any" --> rfc3339-validator
    jsonschema -- "[format-nongpl] any" --> uri-template
    jsonschema-specifications -- ">=0.31.0" --> referencing
    license-expression -- ">=4.0" --> boolean-py
    mako -- ">=2.0" --> markupsafe
    markdown-it-py -- "~=0.1" --> mdurl
    nab-index -- "==0.0.17" --> nab-provider
    nab-index -- ">=0.10" --> truststore
    nab-index -- ">=2.0" --> urllib3
    nab-index -- ">=24.0" --> packaging
    nab-index -- ">=4.6" --> typing-extensions
    nab-project -- "==0.0.17" --> nab-index
    nab-project -- "==0.0.17" --> nab-markersets
    nab-project -- "==0.0.17" --> nab-provider
    nab-project -- "==0.0.17" --> nab-resolver
    nab-project -- ">=1.0" --> installer
    nab-project -- ">=1.2" --> build
    nab-project -- ">=1.2" --> pyproject-hooks
    nab-project -- ">=1.2" --> tomli-w
    nab-project -- ">=2.2" --> tomli
    nab-project -- ">=24.0" --> packaging
    nab-project -- ">=4.6" --> typing-extensions
    nab-provider -- "==0.0.17" --> nab-markersets
    nab-provider -- "==0.0.17" --> nab-resolver
    nab-provider -- ">=4.6" --> typing-extensions
    openstudiolandscapes-dagstercodelocation-jobprocessor -- "==1.9.11" --> dagster
    openstudiolandscapes-dagstercodelocation-jobprocessor -- "any" --> gazu
    openstudiolandscapes-dagstercodelocation-jobprocessor -- "any" --> openstudiolandscapes-dagstercodelocation-streamingprocess
    openstudiolandscapes-dagstercodelocation-streamingprocess -- "==1.9.11" --> dagster
    openstudiolandscapes-deadline-10-2 -- "==1.9.11" --> dagster
    openstudiolandscapes-deadline-10-2 -- "any" --> docker-compose-graph
    openstudiolandscapes-deadline-10-2 -- "any" --> email-validator
    openstudiolandscapes-deadline-10-2 -- "any" --> gitpython
    openstudiolandscapes-deadline-10-2 -- "any" --> openstudiolandscapes-dagstercodelocation-jobprocessor
    openstudiolandscapes-deadline-10-2 -- "any" --> openstudiolandscapes-dagstercodelocation-streamingprocess
    openstudiolandscapes-deadline-10-2 -- "any" --> pyyaml
    openstudiolandscapes-deadline-10-2 -- "any" --> ruamel-yaml
    openstudiolandscapes-deadline-10-2 -- "any" --> snakemd
    pip-requirements-parser -- "any" --> packaging
    pip-requirements-parser -- "any" --> pyparsing
    pipdeptree -- ">=0.0.11" --> nab-index
    pipdeptree -- ">=0.0.14" --> nab-project
    py-serializable -- ">=0.7.1,<0.8.0" --> defusedxml
    pydantic -- "==2.46.5" --> pydantic-core
    pydantic -- ">=0.4.2" --> typing-inspection
    pydantic -- ">=0.6.0" --> annotated-types
    pydantic -- ">=4.14.1" --> typing-extensions
    pydantic-core -- ">=4.14.1" --> typing-extensions
    pydot -- ">=3.1.0" --> pyparsing
    python-dateutil -- ">=1.5" --> six
    python-engineio -- ">=0.10.0" --> simple-websocket
    python-socketio -- ">=0.21.0" --> bidict
    python-socketio -- ">=4.13.2" --> python-engineio
    python-socketio -- "[client] >=0.54.0" --> websocket-client
    python-socketio -- "[client] >=2.21.0" --> requests
    referencing -- ">=0.7.0" --> rpds-py
    referencing -- ">=22.2.0" --> attrs
    referencing -- ">=4.4.0" --> typing-extensions
    requests -- ">=1.26,<3" --> urllib3
    requests -- ">=2,<4" --> charset-normalizer
    requests -- ">=2.5,<4" --> idna
    requests -- ">=2023.5.7" --> certifi
    rfc3339-validator -- "any" --> six
    rfc3987-syntax -- ">=1.2.2" --> lark
    rich -- ">=2.13.0,<3.0.0" --> pygments
    rich -- ">=2.2.0" --> markdown-it-py
    simple-websocket -- "any" --> wsproto
    sqlalchemy -- ">=1" --> greenlet
    sqlalchemy -- ">=4.6.0" --> typing-extensions
    typing-inspection -- ">=4.15.0" --> typing-extensions
    universal-pathlib -- ">=0.5.1,<0.6.0" --> pathlib-abc
    universal-pathlib -- ">=2024.5.0" --> fsspec
    wheel -- ">=24.0" --> packaging
    wsproto -- ">=0.16.0,<1" --> h11
